УправлениПарком/src/Catalogs/Аттракционы/Аттракционы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аттракционы</name>
  <attributes>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.АттракционыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоПеренесено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениПарком/src/Catalogs/Аттракционы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Перенос файлов картинк с ододного реквизита в другой
// Для запуска этой процедуры надо внести изменения в общиймодуль  ОбновлениеИнформационнойБазыПА
// а затем изменить изменить версию конфигурации (в св-вах) на такуюже как в общем модуле

Процедура ПеренестиФотоВПрисоединенныеФайлы(ПараметрыОбработки) Экспорт
	
	ПараметрыОбработки.ОбработкаЗавершена = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Аттракционы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Аттракционы КАК Аттракционы
		|ГДЕ
		|	НЕ Аттракционы.ФотоПеренесено";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой()Тогда
		ПараметрыОбработки.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДанныеФото = СпрОбъект.УдалитьФото.Получить();
			
			Если ДанныеФото <> Неопределено Тогда
				ПренестиФотоВПрисоединенныйФайл(СпрОбъект, ДанныеФото);
			КонецЕсли;
			
			СпрОбъект.ФотоПеренесено = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение; 
		КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры

Процедура ПренестиФотоВПрисоединенныйФайл(СпрОбъект, ДанныеФото)
	
	АдресДанныхФайда = ПоместитьВоВременноеХранилище(ДанныеФото);
	
	ПараметрыДобавления = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыДобавления.ВладелецФайлов = СпрОбъект.Ссылка;
	ПараметрыДобавления.ИмяБезРасширения = "image";
	ПараметрыДобавления.РасширениеБезТочки = "PNG";
	
	ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыДобавления, АдресДанныхФайда);
	СпрОбъект.Фото = ПрисоединенныйФайл;
	СпрОбъект.УдалитьФото = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
